FKDD_COPY_DIFF_3_2026-02-13/Enums/ns_VehicleTypeМотоциклы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ns_VehicleTypeМотоциклы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Багги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вездеходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Картинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квадроциклы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МопедыИСкутеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мотоциклы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Снегоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ns_МотоциклыИМототехника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_МотоциклыИМототехника</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AdStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowEmail</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AllowEmail</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvitoId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Category</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Condition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ConditionМотоциклыИМототехника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Comment>Уникальный идентификатор объявления в вашей базе данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListingFee</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ListingFee</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MotoType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_MotoType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nsDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VehicleType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_VehicleTypeМотоциклы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VideoURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныЗаголовков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/ns_МотоциклыИМототехникаВалидация/Ext/Module.bsl
Функция ПолучитьОбязательныеПоля() Экспорт
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Category");
	ОбязательныеПоля.Добавить("Title");
	ОбязательныеПоля.Добавить("VehicleType");
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция ПолучитьОбязательныеПоляШаблона() Экспорт
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Address");
	ОбязательныеПоля.Добавить("Category");
	ОбязательныеПоля.Добавить("Description");
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция ПолучитьДополнительныеОбязательныеПоля(VehicleType) Экспорт
	ОбязательныеПоля = Новый Массив;
	Если VehicleType = Перечисления.ns_VehicleTypeМотоциклы.Мотоциклы Тогда
		ОбязательныеПоля.Добавить("MotoType");
	КонецЕсли; 
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция СнятьБезОстатковСВыгрузки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_МотоциклыИМототехника.Ссылка КАК Ссылка,
	|	ns_МотоциклыИМототехника.Номенклатура КАК Номенклатура,
	|	ns_МотоциклыИМототехника.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ns_МотоциклыИМототехника КАК ns_МотоциклыИМототехника
	|ГДЕ
	|	ns_МотоциклыИМототехника.Выгружать = ИСТИНА";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Выгрузка = РезультатЗапроса.Выгрузить();
	Номенклатура = Выгрузка.ВыгрузитьКолонку("Номенклатура");
	Остатки = ns_Переопределяемый.ПолучитьТаблицуОстатков(Номенклатура);
	
	Для каждого Стр Из Выгрузка Цикл
		Если ЗначениеЗаполнено(Стр.Характеристика) Тогда
			Идентификатор = Строка(Стр.Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Стр.Характеристика.УникальныйИдентификатор());
		Иначе
			Идентификатор = Строка(Стр.Номенклатура.УникальныйИдентификатор());
		КонецЕсли; 
		
		Если Остатки[Идентификатор] = Неопределено Тогда
			СпрОбъект = Стр.Ссылка.ПолучитьОбъект();
			СпрОбъект.Выгружать = Ложь;
			СпрОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции

Функция ПроверитьОшибкиПриВыгрузке(Данные, ТаблицаОшибок, Картинки = Неопределено) Экспорт
	ЕстьОшибка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Данные.Category) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле Category", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Данные.Title) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле Title", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Данные.VehicleType) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле VehicleType", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если Картинки = Неопределено Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не указана картинка товара", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	Иначе
		КартинкиТовара = Картинки[Данные.Ссылка];
		Если КартинкиТовара = Неопределено Тогда
			ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не указана картинка товара", Данные, ТаблицаОшибок);
			ЕстьОшибка = Истина; 
		ИначеЕсли КартинкиТовара.Количество() = 0 Тогда	
			ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не указана картинка товара", Данные, ТаблицаОшибок);
			ЕстьОшибка = Истина; 
		КонецЕсли;
	КонецЕсли;	
	
	ДопПоля = ПолучитьДополнительныеОбязательныеПоля(Данные.VehicleType);
	Для каждого ТекПоле Из ДопПоля Цикл
		Если НЕ ЗначениеЗаполнено(Данные[ТекПоле]) Тогда
			ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле " + ТекПоле, Данные, ТаблицаОшибок);
			ЕстьОшибка = Истина;
		КонецЕсли;
	КонецЦикла;        
	
	Возврат ЕстьОшибка;
КонецФункции

Функция УстановитьВидимость_MotoType(VehicleType) Экспорт
	Если VehicleType = Перечисления.ns_VehicleTypeМотоциклы.Мотоциклы Тогда
		Возврат Истина;	
	КонецЕсли; 
	
	Возврат Ложь;
КонецФункции
